# #++++++++++++++++++++++++++++++++++++++++++++++++
# # Методы строк
# #++++++++++++++++++++++++++++++++++++++++++++++++
# #================================================
# # 1. Работа с регистром
# #================================================
s = "Python для автоматизации"

print(s.upper()) # В верхний регистр
print(s.lower()) # В нижний регистр

# #================================================
# # 2. Подсчет вхождений подстроки
# #================================================
msg = "абракадабра"

count_ra = msg.count("ра") #Сколько раз встречается "ра" во всей строке?
print(count_ra) # → 2

count_a_from_3rd = msg.count("а", 2) #Сколько раз встречается "а", начиная с 3-го символа? 3-й символ→индекс 2
print(count_a_from_3rd) # → 4

# #================================================
# # 3. Поиск подстроки
# #================================================
s = "абракадабра"

first_ka = s.find("ка") # Индекс первого вхождения "ка"
print(first_ka) # → 4

last_a = s.rfind("а") # Индекс последнего вхождения "а"
print(last_a)  # → 10

not_found = s.find("xyz") # Поиск несуществующей подстроки "xyz"
print(not_found) # → -1

# #================================================
# # 4. Замена подстроки
# #================================================
text = "Я изучаю Java"

new_text = text.replace("Java","Python") # Заменить "Java" на "Python"
print(new_text) # → Я изучаю Python

no_spaces = new_text.replace(" ", "") # Удалить все пробелы из строки
print(no_spaces)  # → ЯизучаюPython

# #================================================
# # 5. Проверка содержимого строки
# #================================================
print("Python".isalpha()) # Состоит ли "Python" только из букв? → True

print("12345".isdigit()) # Состоит ли "12345" только из цифр? → True

print("123abc".isdigit()) # Состоит ли "123abc" только из цифр? → False

# #================================================
# # 6. Дополнение строк
# #================================================
code = "42"
padded_code = code.zfill(5) # Дополнить "42" до 5 символов нулями слева
print(padded_code)  # → "00042"

text = "text"
aligned_text = text.ljust(10, '*') # Выровнять "text" по ширине 10, добавляя '*' справа
print(aligned_text)  # → "text******"

# #================================================
# # 7. Разбиение строк
# #================================================
s1 = "яблоко, груша, банан"
parts1 = s1.split(", ") # Разбить "яблоко, груша, банан" на список слов
print(parts1)

s2 = "Python;Java;C++"
parts2 = s2.split(";") # Разбить "Python;Java;C++" по ";"
print(parts2)

# #================================================
# # 8. Объединение списка в строку
# #================================================
words1 = ["Привет", "мир", "!"]
result1 = " ".join(words1) # Соединить ["Привет", "мир", "!"] с пробелами
print(result1)

words2 = ["apple", "banana", "cherry"]
result2 = ", ".join(words2) # Соединить ["apple", "banana", "cherry"] через ", "
print(result2)

# #================================================
# # 9. Удаление пробелов
# #================================================
left_clean = " Python".lstrip() # Удалить пробелы слева в строке " Python"
print(repr(left_clean)) # → 'Python'  (repr покажет, что пробелов нет)

right_clean = "Python ".rstrip() # Удалить пробелы справа в строке "Python "
print(repr(right_clean)) # → 'Python'

both_clean = " Python ".strip() # Удалить пробелы с обеих сторон в строке " Python "
print(repr(right_clean)) # → 'Python'

# #================================================
# # 10. Дополнительное задание
# #================================================
text = "программирование"

capitalized = text.capitalize() # Сделать первую букву заглавной
print(capitalized) # Программирование

count_r = text.count("р") # Количество букв "р"
print(count_r)  # 3

index_i = text.find("и") # Индекс первой буквы "и"
print(index_i)   # 8

reversed_text = text[::-1] # Развёрнутая строка
print(reversed_text) # еинавормиргорп

# #++++++++++++++++++++++++++++++++++++++++++++++++
# # Спецсимволы
# #++++++++++++++++++++++++++++++++++++++++++++++++
# #================================================
# # 1. Перевод строки
# #================================================
text = "Hello\nPython" # \n — это последовательность (спецсимвол), приказывает перейти на следующую строку
print(text)

# #================================================
# # 2. Горизонтальная табуляция
# #================================================
t = "Python\tAutomation"  #  \t сдвигает текст до ближайшего таб-стопа.
print(t)

# #================================================
# # 3. Экранирование символов
# #================================================
path = "C:\new\test.txt"
print(path)

path = "C:\\new\\test.txt" # Экранирование обратного слеша (\\)
print(path)

wine = "Марка вина \"Ягодка\""  # Экранирование двойных кавычек (\")
print(wine)

# #================================================
# # 4. Сырые (raw) строки
# #================================================
path_raw = r"C:\new\test.txt" # Создаём «сырую» строку с префиксом r (без искажений!) Безопасна и читаема
print(path_raw)

path_normal = "C:\new\test.txt"  # \n и \t интерпретируются! Опасна для путей и regex
print(path_normal)

# #================================================
# # 5. Использование разных спецсимволов
# #================================================
s = "Hello\b World" # \b (backspace) сдвигает курсор на 1 позицию назад. Пробел → затирает 'o'
print(s)

s = "Hello\fPython" # \f — это "form feed" — символ перевода на новую страницу (от печатающих устройств)
print(s)

# #================================================
# # 6. Дополнительное задание ЕГО НЕТУ НА github
# #================================================

# #++++++++++++++++++++++++++++++++++++++++++++++++
# # Форматирование строк
# #++++++++++++++++++++++++++++++++++++++++++++++++
# #================================================
# # 1. Формирование строк через конкатенацию
# #================================================
name = "Сергей"
age = 36

result = "Меня зовут " + name + ", мне " +str(age) + " лет." # Формируем строку через конкатенацию (+)
print(result)

# result = "Меня зовут " + name + ", мне " + age + " лет." TypeError: can only concatenate str (not "int") to str

# #================================================
# # 2. Форматирование строк с .format()
# #================================================
name = "Сергей"
age = 36

result1 = "Привет, меня зовут {}, мне {} лет.".format(name, age) # {} — позиционные плейсхолдеры: первый {} → первый аргумент, второй → второй
print(result1)

result2 = "Привет, меня зовут {name}, мне {age} лет.".format(name=name, age=age) # Именованные параметры ({name}, {age}) Указываем имя в {}
print(result2)

result_reversed = "Мне {1} лет, а зовут меня {0}.".format(name, age) # Изменение порядка переменных в .format()  Можно указать индексы в {}
print(result_reversed)

# #================================================
# # 3. Использование F-строк
# #================================================
city = "Москва"
year = 2026

message = f"Сегодня {year} год, и я живу в {city}" # Простая подстановка переменных в f-строку
print(message)

message2 = f"Через 5 лет будет {year + 5} год." # Выражение внутри f-строки: {год + 5}
print(message2)

# #================================================
# # 4. Операции внутри F-строк
# #================================================
name = "сергей"
age = 36

message = f"Дважды мой возраст: {2 * age}" # Арифметика внутри f-строки
print(message)

message2 = f"Имя в верхнем регистре: {name.upper()}" # Вызов метода внутри f-строки: .upper()
print(message2)

# #================================================
# # 5. Дополнительное задание
# #================================================
dollars = 1
rate = 92.5
currency = "рубля"

currency_info_named = ("Курс валют: {dollars} доллар = {rate} {currency}." # Формируем строку с подстановкой
                       .format(dollars=dollars, rate=rate, currency=currency))
print(currency_info_named)

square_info = f"Квадрат числа 7 равен {7 ** 2}." # Вычисляем 7 ** 2 ПРЯМО внутри f-строки
print(square_info)

num = 7
square_dynamic = f"Квадрат числа {num} равен {num ** 2}." # 💡 Для гибкости — можно и с переменной
print(square_dynamic)




