# #++++++++++++++++++++++++++++++++++++++++++++++++
# # "Числа и арифметические операции"
# #++++++++++++++++++++++++++++++++++++++++++++++++
# #================================================
# # 1. Работа с целыми и вещественными числами
# #================================================
# # Целые числа
# a = 8
# b = 3
# # Вещественные (дробные) числа
# x = 2.5
# y = -1.7
# # Вывод значений и типов всех четырёх переменных
# print(a)
# print(type(a))
#
# print(b)
# print(type(b))
#
# print(x)
# print(type(x))
#
# print(y)
# print(type(y))

# #================================================
# # 2. Основные арифметические операции
# #================================================
# num1 = 10
# num2 = 3
# # Вывод результатов всех операций
# print(num1 + num2)   # сложение
# print(num1 - num2)   # вычитание
# print(num1 * num2)   # умножение
# print(num1 / num2)   # деление (всегда float!)
# print(num1 // num2)  # целочисленное деление (округление вниз)
# print(num1 % num2)   # остаток от деления
# print(num1 ** num2)  # возведение в степень

# #================================================
# # 3. Особенности работы с делением
# #================================================
# a = 10
# b = 3
# print(a / b)
# print(a // b)
# print(a % b)
#
# a = -10
# b = 3
# print(a / b)
# print(a // b)
# print(a % b)
#
# a = 10
# b = -3
# print(a / b)
# print(a // b)
# print(a % b)

# #================================================
# # 4. Работа с приоритетом операторов
# #================================================
## Вычисляем и выводим результаты
# print(5 + 3 * 2)        #  11
# print((5 + 3) * 2)      #  16
# print(10 / 2 ** 2)      #  2.5
# print(10 / (2 ** 2))    #  2.5
# print(20 - 3 * 4 / 2)   #  14.0

# print((5 + 3) * 2)        #  16
# print(5 + (3 * 2))        #  11
# print((10 / 2) ** 2)      #  25.0
# print((20 - 3) * 4 / 2)   #  34.0
# print((20 - 3 * 4) / 2)   #  4.0

# #================================================
# # 5. Возведение в степень
# #================================================
# print(2 ** 3)
# print(4 ** 0.5)
# print(27 ** (1/3))
# print(5 ** -1)

# #================================================
# # 6. Использование сокращенных операторов
# #================================================
# count = 10
# print(count)
# count += 5 # Увеличиваем на 5
# print(count)
# count -= 3 # Уменьшаем на 3
# print(count)
# count *= 2 # Умножаем на 2
# print(count)
# count /= 4 # Делим на 4
# print(count)

# #++++++++++++++++++++++++++++++++++++++++++++++++
# #"Строки в Python".
# #++++++++++++++++++++++++++++++++++++++++++++++++
# #================================================
# # 1. Создание строк
# #================================================
## Однострочные строки (двойные и одинарные кавычки)
# s1 = "Python"
# s2 = 'Программирование'
# print(s1)
# print(s2)
#
# # Многострочная строка (тройные кавычки)
# multi_line = """Это
# многострочная
# строка."""
# print(multi_line)
#
# # Пустая строка и её длина
# empty = "   "
# print(len(empty))

# #================================================
# # 2. Конкатенация строк
# #================================================
# first_name = "Иван"
# last_name = "Петров"
#
# full_name = first_name + " " + last_name # Объединяем с пробелом (Конкатенация)
# # full_name = f"{first_name} {last_name}"
#
# print(full_name)

# #================================================
# # 3. Преобразование типов
# #================================================
# s = "Возраст: "
# age = 25
# result = s + str(age) # Объединяем с помощью str()
# # result = f"{s}{age}"
# # result = f"Возраст: {age}"
# print(result)

# #================================================
# # 4. Дублирование строк
# #================================================
# print("ха " * 5) # Дублирование строки 5 раз
# # print("ха " * 2.5) TypeError: can't multiply sequence by non-int of type 'float'
# a = 2.5
# b = "ха"
# c = (b + " ") * int(a)
# print(c)

# #================================================
# # 5. Длина строки
# #================================================
# text = "Привет, мир!"
# print(len(text)) # Длина строки
#
# empty = ""
# print(len(empty)) # Пустая строка

# #================================================
# # 6. Проверка вхождения подстроки
# #================================================
# sentence = "Я изучаю Python"
# # Проверка наличия "Python"
# print("Python" in sentence)
# # Проверка наличия "Java"
# print("Java" in sentence)

# #================================================
# # 7. Сравнение строк
# #================================================
# a = "apple"
# b = "banana"
#
# print(a == b)   # равно?
# print(a != b)   # не равно?
# print(a < b)    # a меньше b?
# print(a > b)    # a больше b?
# print(a <= b)   # a меньше или равно b?
# print(a >= b)   # a больше или равно b?

# #================================================
# # 8. Код символов
# #================================================
# print(ord('A'))
# print(ord('a'))
# print(ord('Я'))